imbluedabr/m33mu/cpu/nrf54lm20/nrf54lm20_mmio.c
/* m33mu -- an ARMv8-M Emulator
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 */
#include <string.h>
#include <stdio.h>
#include "nrf54lm20/nrf54lm20_mmio.h"
#include "m33mu/memmap.h"
#include "m33mu/flash_persist.h"
#include "m33mu/gpio.h"

#define FICR_BASE_NS 0x00FFC000u
#define FICR_SIZE    0x1000u

#define FICR_INFO_BASE 0x300u
#define FICR_INFO_RAM  0x328u
#define FICR_INFO_RRAM 0x32Cu

#define GPIO_P0_BASE_NS 0x4010A000u
#define GPIO_P1_BASE_NS 0x400D8200u
#define GPIO_P2_BASE_NS 0x40050400u
#define GPIO_P3_BASE_NS 0x400D8600u
#define GPIO_P0_BASE_S  0x5010A000u
#define GPIO_P1_BASE_S  0x500D8200u
#define GPIO_P2_BASE_S  0x50050400u
#define GPIO_P3_BASE_S  0x500D8600u
#define GPIO_SIZE       0x300u

#define GPIO_OUT     0x004u
#define GPIO_OUTSET  0x008u
#define GPIO_OUTCLR  0x00Cu
#define GPIO_IN      0x010u
#define GPIO_DIR     0x014u
#define GPIO_DIRSET  0x018u
#define GPIO_DIRCLR  0x01Cu
#define GPIO_LATCH   0x020u
#define GPIO_DETECTMODE 0x024u
#define GPIO_PIN_CNF0 0x200u

#define RRAMC_BASE_S 0x5004E000u
#define RRAMC_SIZE   0x1000u

#define RRAMC_READY    0x400u
#define RRAMC_READYNEXT 0x404u
#define RRAMC_CONFIG   0x500u
#define RRAMC_ERASEALL 0x540u

#define CLOCK_BASE_NS 0x4010E000u
#define CLOCK_BASE_S  0x5010E000u
#define CLOCK_SIZE    0x1000u

#define CLOCK_TASKS_XOSTART   0x000u
#define CLOCK_TASKS_XOSTOP    0x004u
#define CLOCK_TASKS_PLLSTART  0x008u
#define CLOCK_TASKS_PLLSTOP   0x00Cu
#define CLOCK_TASKS_LFCLKSTART 0x010u
#define CLOCK_TASKS_LFCLKSTOP  0x014u
#define CLOCK_TASKS_CAL       0x018u
#define CLOCK_TASKS_XOTUNE    0x01Cu
#define CLOCK_TASKS_XOTUNEABORT 0x020u
#define CLOCK_TASKS_XO24MSTART 0x024u
#define CLOCK_TASKS_XO24MSTOP  0x028u

#define CLOCK_EVENTS_XOSTARTED  0x100u
#define CLOCK_EVENTS_PLLSTARTED 0x104u
#define CLOCK_EVENTS_LFCLKSTARTED 0x108u
#define CLOCK_EVENTS_DONE       0x10Cu
#define CLOCK_EVENTS_XOTUNED    0x110u
#define CLOCK_EVENTS_XOTUNEERROR 0x114u
#define CLOCK_EVENTS_XOTUNEFAILED 0x118u
#define CLOCK_EVENTS_XO24MSTARTED 0x11Cu

#define CLOCK_INTEN    0x300u
#define CLOCK_INTENSET 0x304u
#define CLOCK_INTENCLR 0x308u
#define CLOCK_INTPEND  0x30Cu

#define CLOCK_XO_RUN   0x408u
#define CLOCK_XO_STAT  0x40Cu
#define CLOCK_PLL_RUN  0x428u
#define CLOCK_PLL_STAT 0x42Cu
#define CLOCK_LFCLK_SRC 0x440u
#define CLOCK_LFCLK_RUN 0x448u
#define CLOCK_LFCLK_STAT 0x44Cu
#define CLOCK_LFCLK_SRCCOPY 0x450u
#define CLOCK_PLL24M_STAT 0x46Cu

#define OSCILLATORS_BASE_NS 0x40120000u
#define OSCILLATORS_BASE_S  0x50120000u
#define OSCILLATORS_SIZE    0x1000u

#define OSC_PLL_FREQ        0x800u
#define OSC_PLL_CURRENTFREQ 0x804u

#define GRTC_BASE_NS 0x400E2000u
#define GRTC_BASE_S  0x500E2000u
#define GRTC_SIZE    0x1000u

#define GRTC_TASKS_CAPTURE0 0x000u
#define GRTC_TASKS_START    0x060u
#define GRTC_TASKS_STOP     0x064u
#define GRTC_TASKS_CLEAR    0x068u

#define GRTC_EVENTS_COMPARE0 0x100u

#define GRTC_INTEN0    0x300u
#define GRTC_INTENSET0 0x304u
#define GRTC_INTENCLR0 0x308u
#define GRTC_INTPEND0  0x30Cu
#define GRTC_INT_GROUP_STRIDE 0x10u

#define GRTC_MODE      0x510u
#define GRTC_CC_BASE   0x520u
#define GRTC_CC_STRIDE 0x10u
#define GRTC_CC_CCL    0x000u
#define GRTC_CC_CCH    0x004u
#define GRTC_CC_CCADD  0x008u
#define GRTC_CC_CCEN   0x00Cu

#define GRTC_INTERVAL  0x6A8u
#define GRTC_STATUS_LFTIMER 0x6B0u
#define GRTC_STATUS_PWM     0x6B4u
#define GRTC_STATUS_CLKOUT  0x6B8u

#define GRTC_SYSCOUNTER_BASE   0x720u
#define GRTC_SYSCOUNTER_STRIDE 0x10u
#define GRTC_SYSCOUNTERL 0x000u
#define GRTC_SYSCOUNTERH 0x004u
#define GRTC_SYSCOUNTER_ACTIVE 0x008u

#define GRTC_CC_COUNT 12u
#define GRTC_SYSCOUNTER_COUNT 4u
#define GRTC_INT_GROUPS 4u
#define GRTC_IRQ_BASE 226

#define CLOCK_EVENT_XOSTARTED_BIT    (1u << 0)
#define CLOCK_EVENT_PLLSTARTED_BIT   (1u << 1)
#define CLOCK_EVENT_LFCLKSTARTED_BIT (1u << 2)
#define CLOCK_EVENT_DONE_BIT         (1u << 3)
#define CLOCK_EVENT_XOTUNED_BIT      (1u << 4)
#define CLOCK_EVENT_XOTUNEERROR_BIT  (1u << 5)
#define CLOCK_EVENT_XOTUNEFAILED_BIT (1u << 6)
#define CLOCK_EVENT_XO24MSTARTED_BIT (1u << 7)

struct gpio_bank {
    mm_u32 regs[GPIO_SIZE / 4];
    mm_u32 pin_cnf[32];
};

struct ficr_state {
    mm_u32 regs[FICR_SIZE / 4];
};

struct rramc_state {
    mm_u32 regs[RRAMC_SIZE / 4];
    mm_u8 *flash;
    mm_u32 flash_size;
    const struct mm_flash_persist *persist;
    mm_u32 flags;
    mm_u32 base_s;
    mm_u32 base_ns;
};

struct clock_state {
    mm_u32 regs[CLOCK_SIZE / 4];
    mm_u32 events_mask;
    mm_u32 inten;
    mm_u32 lfclk_src;
    mm_bool xo_running;
    mm_bool pll_running;
    mm_bool lfclk_running;
    mm_bool xo_triggered;
    mm_bool pll_triggered;
    mm_bool lfclk_triggered;
    mm_bool pll24m_running;
};

struct osc_state {
    mm_u32 regs[OSCILLATORS_SIZE / 4];
};

struct grtc_state {
    mm_u32 regs[GRTC_SIZE / 4];
    mm_u64 syscounter;
    mm_u64 cc[GRTC_CC_COUNT];
    mm_u32 cc_active_mask;
    mm_u32 events_compare_mask;
    mm_u32 inten[GRTC_INT_GROUPS];
    mm_u64 accum_cycles;
    mm_bool running;
};

static struct gpio_bank gpio_banks[4];
static struct ficr_state ficr_state;
static struct rramc_state rramc_state;
static struct clock_state clock_state;
static struct osc_state osc_state;
static struct grtc_state grtc_state;
static struct mm_nvic *g_nrf54lm20_nvic = 0;

static mm_u32 read_slice(mm_u32 reg, mm_u32 offset_in_reg, mm_u32 size_bytes)
{
    mm_u32 shift = offset_in_reg * 8u;
    mm_u32 mask = (size_bytes == 4u) ? 0xFFFFFFFFu : ((1u << (size_bytes * 8u)) - 1u);
    return (reg >> shift) & mask;
}

static mm_u32 apply_write(mm_u32 cur, mm_u32 offset_in_reg, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 shift = offset_in_reg * 8u;
    mm_u32 mask = (size_bytes == 4u) ? 0xFFFFFFFFu : ((1u << (size_bytes * 8u)) - 1u);
    mm_u32 shifted = (value & mask) << shift;
    return (cur & ~(mask << shift)) | shifted;
}

static void clock_update_irq(struct clock_state *clk)
{
    mm_u32 pending;
    if (clk == 0 || g_nrf54lm20_nvic == 0) return;
    pending = clk->events_mask & clk->inten;
    if (pending != 0u) {
        mm_nvic_set_pending(g_nrf54lm20_nvic, 270u, MM_TRUE);
    }
}

