imbluedabr/m33mu/cpu/nrf54lm20/nrf54lm20_mmio.c
static void clock_set_event(struct clock_state *clk, mm_u32 offset, mm_u32 bit)
{
    if (clk == 0) return;
    clk->regs[offset / 4] = 1u;
    clk->events_mask |= bit;
    clock_update_irq(clk);
}

static mm_u32 clock_event_bit_for_offset(mm_u32 offset)
{
    switch (offset) {
    case CLOCK_EVENTS_XOSTARTED:
        return CLOCK_EVENT_XOSTARTED_BIT;
    case CLOCK_EVENTS_PLLSTARTED:
        return CLOCK_EVENT_PLLSTARTED_BIT;
    case CLOCK_EVENTS_LFCLKSTARTED:
        return CLOCK_EVENT_LFCLKSTARTED_BIT;
    case CLOCK_EVENTS_DONE:
        return CLOCK_EVENT_DONE_BIT;
    case CLOCK_EVENTS_XOTUNED:
        return CLOCK_EVENT_XOTUNED_BIT;
    case CLOCK_EVENTS_XOTUNEERROR:
        return CLOCK_EVENT_XOTUNEERROR_BIT;
    case CLOCK_EVENTS_XOTUNEFAILED:
        return CLOCK_EVENT_XOTUNEFAILED_BIT;
    case CLOCK_EVENTS_XO24MSTARTED:
        return CLOCK_EVENT_XO24MSTARTED_BIT;
    default:
        return 0u;
    }
}

static void grtc_update_irq(struct grtc_state *grtc)
{
    int group;
    if (grtc == 0 || g_nrf54lm20_nvic == 0) return;
    for (group = 0; group < (int)GRTC_INT_GROUPS; ++group) {
        mm_u32 pending = grtc->events_compare_mask & grtc->inten[group];
        if (pending != 0u) {
            mm_nvic_set_pending(g_nrf54lm20_nvic, (mm_u32)(GRTC_IRQ_BASE + group), MM_TRUE);
        }
    }
}

static mm_bool grtc_set_compare_event(struct grtc_state *grtc, mm_u32 ch)
{
    mm_u32 bit;
    if (grtc == 0 || ch >= GRTC_CC_COUNT) return MM_FALSE;
    bit = 1u << ch;
    if ((grtc->events_compare_mask & bit) != 0u) return MM_FALSE;
    grtc->events_compare_mask |= bit;
    grtc->regs[(GRTC_EVENTS_COMPARE0 + ch * 4u) / 4] = 1u;
    grtc_update_irq(grtc);
    return MM_TRUE;
}

static void grtc_sync_cc_regs(struct grtc_state *grtc, mm_u32 ch)
{
    mm_u64 value;
    mm_u32 base;
    if (grtc == 0 || ch >= GRTC_CC_COUNT) return;
    value = grtc->cc[ch];
    base = GRTC_CC_BASE + ch * GRTC_CC_STRIDE;
    grtc->regs[(base + GRTC_CC_CCL) / 4] = (mm_u32)(value & 0xFFFFFFFFu);
    grtc->regs[(base + GRTC_CC_CCH) / 4] = (mm_u32)((value >> 32) & 0xFFFFFFFFu);
}

static mm_bool nrf54lm20_gpio_bank_info(void *opaque, int bank, char *name_out, size_t name_len, int *pins_out)
{
    (void)opaque;
    if (bank < 0 || bank >= 4) {
        return MM_FALSE;
    }
    if (name_out != 0 && name_len > 0u) {
        snprintf(name_out, name_len, "P%d", bank);
    }
    if (pins_out != 0) {
        *pins_out = 32;
    }
    return MM_TRUE;
}

static void gpio_sync_inputs(struct gpio_bank *g)
{
    if (g == 0) return;
    g->regs[GPIO_IN / 4] = g->regs[GPIO_OUT / 4];
}

static mm_bool gpio_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct gpio_bank *g = (struct gpio_bank *)opaque;
    if (g == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GPIO_SIZE) return MM_FALSE;

    if (offset >= GPIO_PIN_CNF0 && size_bytes == 4) {
        mm_u32 pin = (offset - GPIO_PIN_CNF0) / 4u;
        if (pin < 32u) {
            *value_out = g->pin_cnf[pin];
            return MM_TRUE;
        }
    }
    if (offset == GPIO_IN && size_bytes == 4) {
        gpio_sync_inputs(g);
    }
    *value_out = read_slice(g->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool gpio_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct gpio_bank *g = (struct gpio_bank *)opaque;
    if (g == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GPIO_SIZE) return MM_FALSE;

    if (offset >= GPIO_PIN_CNF0 && size_bytes == 4) {
        mm_u32 pin = (offset - GPIO_PIN_CNF0) / 4u;
        if (pin < 32u) {
            g->pin_cnf[pin] = value;
            return MM_TRUE;
        }
    }

    if (offset == GPIO_OUT && size_bytes == 4) {
        g->regs[GPIO_OUT / 4] = value;
        gpio_sync_inputs(g);
        return MM_TRUE;
    }
    if (offset == GPIO_OUTSET && size_bytes == 4) {
        g->regs[GPIO_OUT / 4] |= value;
        gpio_sync_inputs(g);
        return MM_TRUE;
    }
    if (offset == GPIO_OUTCLR && size_bytes == 4) {
        g->regs[GPIO_OUT / 4] &= ~value;
        gpio_sync_inputs(g);
        return MM_TRUE;
    }
    if (offset == GPIO_DIR && size_bytes == 4) {
        g->regs[GPIO_DIR / 4] = value;
        return MM_TRUE;
    }
    if (offset == GPIO_DIRSET && size_bytes == 4) {
        g->regs[GPIO_DIR / 4] |= value;
        return MM_TRUE;
    }
    if (offset == GPIO_DIRCLR && size_bytes == 4) {
        g->regs[GPIO_DIR / 4] &= ~value;
        return MM_TRUE;
    }

    g->regs[offset / 4] = apply_write(g->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

static mm_u32 nrf_gpio_bank_read(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= 4) return 0;
    return gpio_banks[bank].regs[GPIO_OUT / 4];
}

static mm_u32 nrf_gpio_bank_read_moder(void *opaque, int bank)
{
    mm_u32 moder = 0;
    mm_u32 dir;
    int pin;
    (void)opaque;
    if (bank < 0 || bank >= 4) return 0;
    dir = gpio_banks[bank].regs[GPIO_DIR / 4];
    for (pin = 0; pin < 16; ++pin) {
        mm_u32 mode = ((dir >> pin) & 1u) ? 1u : 0u;
        moder |= (mode << (pin * 2));
    }
    return moder;
}

static mm_bool nrf_gpio_bank_clock(void *opaque, int bank)
{
    (void)opaque;
    (void)bank;
    return MM_TRUE;
}

static mm_u32 nrf_gpio_bank_read_seccfgr(void *opaque, int bank)
{
    (void)opaque;
    (void)bank;
    return 0u;
}

static mm_bool ficr_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct ficr_state *ficr = (struct ficr_state *)opaque;
    if (ficr == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > FICR_SIZE) return MM_FALSE;
    *value_out = read_slice(ficr->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool ficr_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct ficr_state *ficr = (struct ficr_state *)opaque;
    if (ficr == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > FICR_SIZE) return MM_FALSE;
    ficr->regs[offset / 4] = apply_write(ficr->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

static mm_bool rramc_write_cb(void *opaque,
                              enum mm_sec_state sec,
                              mm_u32 addr,
                              mm_u32 size_bytes,
                              mm_u32 value)
{
    struct rramc_state *rramc = (struct rramc_state *)opaque;
    mm_u32 base;
    mm_u32 offset;
    mm_u8 *flash;
    (void)sec;

    if (rramc == 0 || rramc->flash == 0) return MM_FALSE;
    if ((rramc->regs[RRAMC_CONFIG / 4] & 1u) == 0u) {
        return MM_FALSE;
    }

