imbluedabr/m33mu/cpu/nrf54lm20/nrf54lm20_mmio.c
    base = (addr >= rramc->base_s) ? rramc->base_s : rramc->base_ns;
    if (addr < base) return MM_FALSE;
    offset = addr - base;
    if (offset + size_bytes > rramc->flash_size) return MM_FALSE;

    flash = rramc->flash;
    if (size_bytes == 4u) {
        mm_u32 cur = (mm_u32)flash[offset] |
                     ((mm_u32)flash[offset + 1u] << 8) |
                     ((mm_u32)flash[offset + 2u] << 16) |
                     ((mm_u32)flash[offset + 3u] << 24);
        mm_u32 next = cur & value;
        flash[offset] = (mm_u8)(next & 0xffu);
        flash[offset + 1u] = (mm_u8)((next >> 8) & 0xffu);
        flash[offset + 2u] = (mm_u8)((next >> 16) & 0xffu);
        flash[offset + 3u] = (mm_u8)((next >> 24) & 0xffu);
    } else if (size_bytes == 2u) {
        mm_u32 cur = (mm_u32)flash[offset] | ((mm_u32)flash[offset + 1u] << 8);
        mm_u32 next = cur & value;
        flash[offset] = (mm_u8)(next & 0xffu);
        flash[offset + 1u] = (mm_u8)((next >> 8) & 0xffu);
    } else if (size_bytes == 1u) {
        flash[offset] &= (mm_u8)(value & 0xffu);
    } else {
        return MM_FALSE;
    }

    if (rramc->persist != 0 && rramc->persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)rramc->persist, addr, size_bytes);
    }
    return MM_TRUE;
}

static void rramc_erase_all(struct rramc_state *rramc)
{
    if (rramc == 0 || rramc->flash == 0) return;
    memset(rramc->flash, 0xFF, rramc->flash_size);
    if (rramc->persist != 0 && rramc->persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)rramc->persist,
                               rramc->base_ns,
                               rramc->flash_size);
    }
}

static mm_bool rramc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct rramc_state *rramc = (struct rramc_state *)opaque;
    if (rramc == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RRAMC_SIZE) return MM_FALSE;

    if (offset == RRAMC_READY && size_bytes == 4) {
        *value_out = 1u;
        return MM_TRUE;
    }
    if (offset == RRAMC_READYNEXT && size_bytes == 4) {
        *value_out = 1u;
        return MM_TRUE;
    }

    *value_out = read_slice(rramc->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool rramc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct rramc_state *rramc = (struct rramc_state *)opaque;
    if (rramc == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RRAMC_SIZE) return MM_FALSE;

    if (offset == RRAMC_ERASEALL && size_bytes == 4) {
        if ((rramc->regs[RRAMC_CONFIG / 4] & 1u) != 0u && (value & 1u) != 0u) {
            rramc_erase_all(rramc);
        }
        return MM_TRUE;
    }

    rramc->regs[offset / 4] = apply_write(rramc->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

static mm_bool clock_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct clock_state *clk = (struct clock_state *)opaque;
    mm_u32 reg = 0;

    if (clk == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > CLOCK_SIZE) return MM_FALSE;

    if (offset == CLOCK_INTEN || offset == CLOCK_INTENSET || offset == CLOCK_INTENCLR) {
        reg = clk->inten;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == CLOCK_INTPEND) {
        reg = clk->events_mask & clk->inten;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == CLOCK_XO_RUN) {
        reg = clk->xo_triggered ? 1u : 0u;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == CLOCK_XO_STAT) {
        reg = clk->xo_running ? (1u << 16) : 0u;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == CLOCK_PLL_RUN) {
        reg = clk->pll_triggered ? 1u : 0u;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == CLOCK_PLL_STAT) {
        reg = clk->pll_running ? (1u << 16) : 0u;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == CLOCK_LFCLK_SRC) {
        reg = clk->lfclk_src & 0x3u;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == CLOCK_LFCLK_RUN) {
        reg = clk->lfclk_triggered ? 1u : 0u;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == CLOCK_LFCLK_STAT) {
        reg = (clk->lfclk_src & 0x3u) | (clk->lfclk_running ? (1u << 16) : 0u);
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == CLOCK_PLL24M_STAT) {
        reg = clk->pll24m_running ? (1u << 16) : 0u;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }

    reg = clk->regs[offset / 4];
    *value_out = read_slice(reg, offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool clock_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct clock_state *clk = (struct clock_state *)opaque;
    mm_u32 bit;

    if (clk == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > CLOCK_SIZE) return MM_FALSE;

    if (offset == CLOCK_TASKS_XOSTART && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->xo_triggered = MM_TRUE;
            clk->xo_running = MM_TRUE;
            clock_set_event(clk, CLOCK_EVENTS_XOSTARTED, CLOCK_EVENT_XOSTARTED_BIT);
            clock_set_event(clk, CLOCK_EVENTS_XOTUNED, CLOCK_EVENT_XOTUNED_BIT);
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_XOSTOP && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->xo_running = MM_FALSE;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_PLLSTART && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->pll_triggered = MM_TRUE;
            clk->pll_running = MM_TRUE;
            clock_set_event(clk, CLOCK_EVENTS_PLLSTARTED, CLOCK_EVENT_PLLSTARTED_BIT);
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_PLLSTOP && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->pll_running = MM_FALSE;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_LFCLKSTART && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->lfclk_triggered = MM_TRUE;
            clk->lfclk_src = clk->regs[CLOCK_LFCLK_SRC / 4] & 0x3u;
            clk->regs[CLOCK_LFCLK_SRCCOPY / 4] = clk->lfclk_src;
            clk->lfclk_running = MM_TRUE;
            clock_set_event(clk, CLOCK_EVENTS_LFCLKSTARTED, CLOCK_EVENT_LFCLKSTARTED_BIT);
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_LFCLKSTOP && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->lfclk_running = MM_FALSE;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_CAL && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clock_set_event(clk, CLOCK_EVENTS_DONE, CLOCK_EVENT_DONE_BIT);
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_XOTUNE && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clock_set_event(clk, CLOCK_EVENTS_XOTUNED, CLOCK_EVENT_XOTUNED_BIT);
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_XOTUNEABORT && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clock_set_event(clk, CLOCK_EVENTS_XOTUNEFAILED, CLOCK_EVENT_XOTUNEFAILED_BIT);
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_XO24MSTART && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->pll24m_running = MM_TRUE;
            clock_set_event(clk, CLOCK_EVENTS_XO24MSTARTED, CLOCK_EVENT_XO24MSTARTED_BIT);
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_XO24MSTOP && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->pll24m_running = MM_FALSE;
        }
        return MM_TRUE;
    }

    bit = clock_event_bit_for_offset(offset);
    if (bit != 0u && size_bytes == 4) {
        if (value == 0u) {
            clk->events_mask &= ~bit;
            clk->regs[offset / 4] = 0u;
        } else {
            clk->events_mask |= bit;
            clk->regs[offset / 4] = value;
        }
        clock_update_irq(clk);
        return MM_TRUE;
    }

    if (offset == CLOCK_INTEN && size_bytes == 4) {
        clk->inten = value;
        clock_update_irq(clk);
        return MM_TRUE;
    }
    if (offset == CLOCK_INTENSET && size_bytes == 4) {
        clk->inten |= value;
        clock_update_irq(clk);
        return MM_TRUE;
    }
    if (offset == CLOCK_INTENCLR && size_bytes == 4) {
        clk->inten &= ~value;
        return MM_TRUE;
    }
    if (offset == CLOCK_LFCLK_SRC && size_bytes == 4) {
        clk->lfclk_src = value & 0x3u;
        clk->regs[offset / 4] = clk->lfclk_src;
        return MM_TRUE;
    }

    clk->regs[offset / 4] = apply_write(clk->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

