imbluedabr/m33mu/cpu/nrf54lm20/nrf54lm20_mmio.c
static mm_bool oscillators_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct osc_state *osc = (struct osc_state *)opaque;
    if (osc == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > OSCILLATORS_SIZE) return MM_FALSE;
    *value_out = read_slice(osc->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool oscillators_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct osc_state *osc = (struct osc_state *)opaque;
    mm_u32 v;
    if (osc == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > OSCILLATORS_SIZE) return MM_FALSE;

    if (offset == OSC_PLL_FREQ && size_bytes == 4) {
        v = value & 0x3u;
        osc->regs[OSC_PLL_FREQ / 4] = v;
        osc->regs[OSC_PLL_CURRENTFREQ / 4] = v;
        return MM_TRUE;
    }
    if (offset == OSC_PLL_CURRENTFREQ) {
        return MM_TRUE;
    }

    osc->regs[offset / 4] = apply_write(osc->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

static mm_bool grtc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct grtc_state *grtc = (struct grtc_state *)opaque;
    mm_u32 reg = 0;
    mm_u32 rel;
    mm_u32 idx;
    mm_u32 sub;
    mm_u32 ch;

    if (grtc == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GRTC_SIZE) return MM_FALSE;

    if (offset >= GRTC_INTEN0 && offset < (GRTC_INTEN0 + GRTC_INT_GROUP_STRIDE * GRTC_INT_GROUPS)) {
        idx = (offset - GRTC_INTEN0) / GRTC_INT_GROUP_STRIDE;
        sub = (offset - GRTC_INTEN0) % GRTC_INT_GROUP_STRIDE;
        if (sub == 0u || sub == 4u || sub == 8u) {
            reg = grtc->inten[idx];
        } else if (sub == 0x0Cu) {
            reg = grtc->events_compare_mask & grtc->inten[idx];
        } else {
            reg = grtc->regs[offset / 4];
        }
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }

    if (offset >= GRTC_EVENTS_COMPARE0 && offset < (GRTC_EVENTS_COMPARE0 + GRTC_CC_COUNT * 4u)) {
        ch = (offset - GRTC_EVENTS_COMPARE0) / 4u;
        reg = (grtc->events_compare_mask >> ch) & 1u;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }

    if (offset >= GRTC_CC_BASE && offset < (GRTC_CC_BASE + GRTC_CC_COUNT * GRTC_CC_STRIDE)) {
        rel = offset - GRTC_CC_BASE;
        ch = rel / GRTC_CC_STRIDE;
        sub = rel % GRTC_CC_STRIDE;
        if (sub == GRTC_CC_CCL) {
            reg = (mm_u32)(grtc->cc[ch] & 0xFFFFFFFFu);
        } else if (sub == GRTC_CC_CCH) {
            reg = (mm_u32)((grtc->cc[ch] >> 32) & 0xFFFFFFFFu);
        } else if (sub == GRTC_CC_CCEN) {
            mm_u32 active = (grtc->cc_active_mask >> ch) & 1u;
            mm_u32 past = (active && grtc->syscounter >= grtc->cc[ch]) ? 1u : 0u;
            reg = active | (past << 1);
        } else {
            reg = 0u;
        }
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }

    if (offset >= GRTC_SYSCOUNTER_BASE &&
        offset < (GRTC_SYSCOUNTER_BASE + GRTC_SYSCOUNTER_COUNT * GRTC_SYSCOUNTER_STRIDE)) {
        rel = offset - GRTC_SYSCOUNTER_BASE;
        sub = rel % GRTC_SYSCOUNTER_STRIDE;
        if (sub == GRTC_SYSCOUNTERL) {
            reg = (mm_u32)(grtc->syscounter & 0xFFFFFFFFu);
        } else if (sub == GRTC_SYSCOUNTERH) {
            reg = (mm_u32)((grtc->syscounter >> 32) & 0x000FFFFFu);
            reg |= (1u << 29);
        } else if (sub == GRTC_SYSCOUNTER_ACTIVE) {
            reg = grtc->regs[offset / 4] & 1u;
        } else {
            reg = 0u;
        }
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }

    if (offset == GRTC_STATUS_LFTIMER || offset == GRTC_STATUS_PWM || offset == GRTC_STATUS_CLKOUT) {
        reg = 1u;
        *value_out = read_slice(reg, offset & 3u, size_bytes);
        return MM_TRUE;
    }

    reg = grtc->regs[offset / 4];
    *value_out = read_slice(reg, offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool grtc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct grtc_state *grtc = (struct grtc_state *)opaque;
    mm_u32 rel;
    mm_u32 idx;
    mm_u32 sub;
    mm_u32 ch;
    mm_u64 base;
    mm_u64 add;

    if (grtc == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GRTC_SIZE) return MM_FALSE;

    if (offset < (GRTC_TASKS_CAPTURE0 + GRTC_CC_COUNT * 4u)) {
        ch = (offset - GRTC_TASKS_CAPTURE0) / 4u;
        if (size_bytes == 4 && (value & 1u) != 0u) {
            grtc->cc[ch] = grtc->syscounter;
            grtc_sync_cc_regs(grtc, ch);
        }
        return MM_TRUE;
    }
    if (offset == GRTC_TASKS_START && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            grtc->running = MM_TRUE;
            grtc->regs[GRTC_MODE / 4] |= (1u << 1);
        }
        return MM_TRUE;
    }
    if (offset == GRTC_TASKS_STOP && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            grtc->running = MM_FALSE;
            grtc->regs[GRTC_MODE / 4] &= ~(1u << 1);
        }
        return MM_TRUE;
    }
    if (offset == GRTC_TASKS_CLEAR && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            grtc->syscounter = 0u;
        }
        return MM_TRUE;
    }

    if (offset >= GRTC_EVENTS_COMPARE0 && offset < (GRTC_EVENTS_COMPARE0 + GRTC_CC_COUNT * 4u)) {
        ch = (offset - GRTC_EVENTS_COMPARE0) / 4u;
        if (size_bytes == 4) {
            if (value == 0u) {
                grtc->events_compare_mask &= ~(1u << ch);
                grtc->regs[offset / 4] = 0u;
            } else {
                grtc->events_compare_mask |= (1u << ch);
                grtc->regs[offset / 4] = value;
            }
            grtc_update_irq(grtc);
        }
        return MM_TRUE;
    }

    if (offset >= GRTC_INTEN0 && offset < (GRTC_INTEN0 + GRTC_INT_GROUP_STRIDE * GRTC_INT_GROUPS)) {
        idx = (offset - GRTC_INTEN0) / GRTC_INT_GROUP_STRIDE;
        sub = (offset - GRTC_INTEN0) % GRTC_INT_GROUP_STRIDE;
        if (size_bytes == 4) {
            if (sub == 0u) {
                grtc->inten[idx] = value;
            } else if (sub == 4u) {
                grtc->inten[idx] |= value;
            } else if (sub == 8u) {
                grtc->inten[idx] &= ~value;
            }
            grtc_update_irq(grtc);
        }
        return MM_TRUE;
    }

    if (offset == GRTC_MODE && size_bytes == 4) {
        grtc->regs[GRTC_MODE / 4] = value;
        grtc->running = ((value & (1u << 1)) != 0u) ? MM_TRUE : MM_FALSE;
        return MM_TRUE;
    }

    if (offset >= GRTC_CC_BASE && offset < (GRTC_CC_BASE + GRTC_CC_COUNT * GRTC_CC_STRIDE)) {
        rel = offset - GRTC_CC_BASE;
        ch = rel / GRTC_CC_STRIDE;
        sub = rel % GRTC_CC_STRIDE;
        if (size_bytes == 4) {
            if (sub == GRTC_CC_CCL) {
                grtc->cc[ch] = (grtc->cc[ch] & 0xFFFFFFFF00000000ull) | value;
                grtc_sync_cc_regs(grtc, ch);
            } else if (sub == GRTC_CC_CCH) {
                grtc->cc[ch] = (grtc->cc[ch] & 0x00000000FFFFFFFFull) | ((mm_u64)value << 32);
                grtc_sync_cc_regs(grtc, ch);
            } else if (sub == GRTC_CC_CCADD) {
                add = (mm_u64)(value & 0x7FFFFFFFu);
                base = (value & 0x80000000u) ? grtc->cc[ch] : grtc->syscounter;
                grtc->cc[ch] = base + add;
                grtc_sync_cc_regs(grtc, ch);
            } else if (sub == GRTC_CC_CCEN) {
                if ((value & 1u) != 0u) {
                    grtc->cc_active_mask |= (1u << ch);
                } else {
                    grtc->cc_active_mask &= ~(1u << ch);
                }
                grtc->regs[offset / 4] = value & 1u;
            }
        }
        return MM_TRUE;
    }

