imbluedabr/m33mu/cpu/nrf54lm20/nrf54lm20_mmio.c
    if (offset >= GRTC_SYSCOUNTER_BASE &&
        offset < (GRTC_SYSCOUNTER_BASE + GRTC_SYSCOUNTER_COUNT * GRTC_SYSCOUNTER_STRIDE)) {
        rel = offset - GRTC_SYSCOUNTER_BASE;
        sub = rel % GRTC_SYSCOUNTER_STRIDE;
        if (sub == GRTC_SYSCOUNTER_ACTIVE && size_bytes == 4) {
            grtc->regs[offset / 4] = value & 1u;
            return MM_TRUE;
        }
    }

    if (offset == GRTC_INTERVAL && size_bytes == 4) {
        grtc->regs[offset / 4] = value;
        return MM_TRUE;
    }

    grtc->regs[offset / 4] = apply_write(grtc->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

mm_bool mm_nrf54lm20_register_mmio(struct mmio_bus *bus)
{
    struct mmio_region reg;
    if (bus == 0) return MM_FALSE;

    memset(&gpio_banks, 0, sizeof(gpio_banks));
    memset(&ficr_state, 0xFF, sizeof(ficr_state));
    memset(&rramc_state, 0, sizeof(rramc_state));
    memset(&clock_state, 0, sizeof(clock_state));
    memset(&osc_state, 0, sizeof(osc_state));
    memset(&grtc_state, 0, sizeof(grtc_state));

    ficr_state.regs[FICR_INFO_RAM / 4] = 0x00000200u;
    ficr_state.regs[FICR_INFO_RRAM / 4] = 0x000007F4u;
    osc_state.regs[OSC_PLL_FREQ / 4] = 0x3u;
    osc_state.regs[OSC_PLL_CURRENTFREQ / 4] = 0x3u;
    grtc_state.regs[GRTC_STATUS_LFTIMER / 4] = 1u;
    grtc_state.regs[GRTC_STATUS_PWM / 4] = 1u;
    grtc_state.regs[GRTC_STATUS_CLKOUT / 4] = 1u;

    reg.base = FICR_BASE_NS;
    reg.size = FICR_SIZE;
    reg.opaque = &ficr_state;
    reg.read = ficr_read;
    reg.write = ficr_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO_P0_BASE_NS;
    reg.size = GPIO_SIZE;
    reg.opaque = &gpio_banks[0];
    reg.read = gpio_read;
    reg.write = gpio_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO_P0_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO_P1_BASE_NS;
    reg.opaque = &gpio_banks[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO_P1_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO_P2_BASE_NS;
    reg.opaque = &gpio_banks[2];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO_P2_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO_P3_BASE_NS;
    reg.opaque = &gpio_banks[3];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO_P3_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = RRAMC_BASE_S;
    reg.size = RRAMC_SIZE;
    reg.opaque = &rramc_state;
    reg.read = rramc_read;
    reg.write = rramc_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = CLOCK_BASE_NS;
    reg.size = CLOCK_SIZE;
    reg.opaque = &clock_state;
    reg.read = clock_read;
    reg.write = clock_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = CLOCK_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = OSCILLATORS_BASE_NS;
    reg.size = OSCILLATORS_SIZE;
    reg.opaque = &osc_state;
    reg.read = oscillators_read;
    reg.write = oscillators_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = OSCILLATORS_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GRTC_BASE_NS;
    reg.size = GRTC_SIZE;
    reg.opaque = &grtc_state;
    reg.read = grtc_read;
    reg.write = grtc_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GRTC_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    mm_gpio_bank_set_reader(nrf_gpio_bank_read, 0);
    mm_gpio_bank_set_moder_reader(nrf_gpio_bank_read_moder, 0);
    mm_gpio_bank_set_clock_reader(nrf_gpio_bank_clock, 0);
    mm_gpio_bank_set_seccfgr_reader(nrf_gpio_bank_read_seccfgr, 0);

    return MM_TRUE;
}

void mm_nrf54lm20_flash_bind(struct mm_memmap *map,
                             mm_u8 *flash,
                             mm_u32 flash_size,
                             const struct mm_flash_persist *persist,
                             mm_u32 flags)
{
    if (map == 0) return;
    rramc_state.flash = flash;
    rramc_state.flash_size = flash_size;
    rramc_state.persist = persist;
    rramc_state.flags = flags;
    rramc_state.base_s = map->flash_base_s;
    rramc_state.base_ns = map->flash_base_ns;
    mm_memmap_set_flash_writer(map, rramc_write_cb, &rramc_state);
}

mm_u64 mm_nrf54lm20_cpu_hz(void)
{
    /* SystemCoreClockUpdate uses OSCILLATORS->PLL.CURRENTFREQ (64/128 MHz). */
    mm_u32 freq = osc_state.regs[OSC_PLL_CURRENTFREQ / 4] & 0x3u;
    if (freq == 0x1u) return 128000000ull;
    if (freq == 0x3u) return 64000000ull;
    return 128000000ull;
}

void mm_nrf54lm20_mmio_reset(void)
{
    memset(&gpio_banks, 0, sizeof(gpio_banks));
    memset(&rramc_state.regs, 0, sizeof(rramc_state.regs));
    rramc_state.regs[RRAMC_READY / 4] = 1u;
    rramc_state.regs[RRAMC_READYNEXT / 4] = 1u;

    memset(&ficr_state, 0xFF, sizeof(ficr_state));
    ficr_state.regs[FICR_INFO_RAM / 4] = 0x00000200u;
    ficr_state.regs[FICR_INFO_RRAM / 4] = 0x000007F4u;

    memset(&clock_state, 0, sizeof(clock_state));
    memset(&osc_state, 0, sizeof(osc_state));
    memset(&grtc_state, 0, sizeof(grtc_state));
    osc_state.regs[OSC_PLL_FREQ / 4] = 0x3u;
    osc_state.regs[OSC_PLL_CURRENTFREQ / 4] = 0x3u;
    grtc_state.regs[GRTC_STATUS_LFTIMER / 4] = 1u;
    grtc_state.regs[GRTC_STATUS_PWM / 4] = 1u;
    grtc_state.regs[GRTC_STATUS_CLKOUT / 4] = 1u;

    mm_gpio_set_bank_info_reader(nrf54lm20_gpio_bank_info, 0);
}

void mm_nrf54lm20_mmio_set_nvic(struct mm_nvic *nvic)
{
    g_nrf54lm20_nvic = nvic;
}

void mm_nrf54lm20_grtc_tick(mm_u64 cycles)
{
    mm_u64 div;
    mm_u64 ticks;
    mm_u64 hz;
    mm_u32 ch;
    mm_u32 interval;
    mm_bool fired;

    if (!grtc_state.running) return;
    hz = mm_nrf54lm20_cpu_hz();
    if (hz == 0u) return;
    div = hz / 1000000ull;
    if (div == 0u) return;

    grtc_state.accum_cycles += cycles;
    ticks = grtc_state.accum_cycles / div;
    if (ticks == 0u) return;
    grtc_state.accum_cycles -= ticks * div;
    grtc_state.syscounter += ticks;

    interval = grtc_state.regs[GRTC_INTERVAL / 4] & 0xFFFFu;
    for (ch = 0; ch < GRTC_CC_COUNT; ++ch) {
        if ((grtc_state.cc_active_mask & (1u << ch)) == 0u) continue;
        if (grtc_state.syscounter >= grtc_state.cc[ch]) {
            fired = grtc_set_compare_event(&grtc_state, ch);
            if (fired && ch == 0u && interval != 0u) {
                grtc_state.cc[0] += interval;
                grtc_sync_cc_regs(&grtc_state, 0u);
            }
        }
    }
}
